const checkTagNameCount = (str) => {
    for (let i = 0; i < str.length; i++) {
        let char = str[i];
        let nextChar = str[i + 1];
        if (char == "<" && nextChar != "/") {
            let tagStr = nextChar + str[i + 2]
                + str[i + 3] + str[i + 4]
                + str[i + 5] + str[i + 6]
                + str[i + 7] + str[i + 8]
                + str[i + 9] + str[i + 10];
            let tag = tagStr.split(" ")[0];
            if (tag.indexOf(">") > 0) {
                tag = tag.substr(0, tag.indexOf(">"))
            }
            if (map[tag]) {
                map[tag]++
            } else {
                map[tag] = 1
            }
        }
    }
};

const compare = (propertyName) => {
    return function (object1, object2) {
        let value1 = object1[propertyName];
        let value2 = object2[propertyName];
        if (value2 > value1) {
            return 1;
        } else if (value2 < value1) {
            return -1;
        } else {
            return 0;
        }
    }
};


const checkChinese = (str) => {
    let reg = new RegExp("[\\u4E00-\\u9FFF]+", "g");
    return reg.test(str);
};

const yesterdayTimestamp = () => {
    let today = new Date();
    today.setHours(0);
    today.setMinutes(0);
    today.setSeconds(0);
    today.setMilliseconds(0);
    return today.getTime() - 86400000
};

const city = (str) => {
    let citys = ["北京", "北京", "上海", "上海", "天津", "天津", "重庆", "重庆", "广东", "广州", "深圳", "佛山", "惠州", "汕头", "东莞", "茂名", "江门", "珠海", "湛江", "肇庆", "揭阳", "中山", "韶关", "阳江", "云浮", "梅州", "清远", "潮州", "汕尾", "河源", "河南", "郑州", "洛阳", "南阳", "新乡", "信阳", "安阳", "平顶山", "驻马店", "焦作", "三门峡", "周口", "许昌", "开封", "商丘", "濮阳", "漯河", "鹤壁", "四川", "成都", "绵阳", "乐山", "德阳", "泸州", "达州", "眉山", "自贡", "南充", "内江", "宜宾", "广安", "雅安", "资阳", "广元", "遂宁", "攀枝花", "巴中", "甘孜", "凉山", "阿坝", "江苏", "苏州", "南京", "无锡", "徐州", "镇江", "盐城", "南通", "常州", "扬州", "泰州", "连云港", "宿迁", "淮安", "湖北", "武汉", "宜昌", "荆州", "襄樊", "十堰", "荆门", "黄冈", "孝感", "黄石", "咸宁", "恩施", "随州", "鄂州", "仙桃", "潜江", "天门", "浙江", "杭州", "温州", "宁波", "金华", "台州", "嘉兴", "绍兴", "湖州", "丽水", "衢州", "舟山", "福建", "福州", "泉州", "厦门", "漳州", "宁德", "三明", "莆田", "南平", "龙岩", "黑龙江", "哈尔滨", "大庆", "绥化", "齐齐哈尔", "佳木斯", "牡丹江", "黑河", "鸡西", "伊春", "鹤岗", "双鸭山", "七台河", "大兴安岭", "山东", "济南", "青岛", "潍坊", "烟台", "临沂", "淄博", "泰安", "济宁", "聊城", "东营", "威海", "德州", "滨州", "莱芜", "枣庄", "菏泽", "日照", "陕西", "西安", "渭南", "咸阳", "宝鸡", "汉中", "榆林", "安康", "延安", "商洛", "铜川", "河北", "石家庄", "唐山", "保定", "沧州", "邯郸", "衡水", "秦皇岛", "廊坊", "邢台", "承德", "张家口", "辽宁", "沈阳", "大连", "锦州", "鞍山", "辽阳", "丹东", "营口", "本溪", "铁岭", "抚顺", "朝阳", "宿迁", "阜新", "葫芦岛", "盘锦", "吉林", "长春", "吉林", "延边", "四平", "白城", "通化", "松原", "白山", "辽源", "云南", "昆明", "红河", "玉溪", "曲靖", "大理", "文山", "保山", "丽江", "昭通", "思茅", "临沧", "楚雄", "新疆", "乌鲁木齐", "石河子", "塔城", "克拉玛依", "阿克苏", "哈密", "巴音郭楞", "阿勒泰", "昌吉", "伊犁哈萨克", "吐鲁番", "喀什", "博尔塔拉", "克孜勒苏柯尔克孜", "和田", "五家渠", "广西", "南宁", "柳州", "桂林", "百色", "河池", "梧州", "贵港", "玉林", "北海", "钦州", "来宾", "贺州", "防城港", "山西", "太原", "运城", "吕梁", "晋中", "临汾", "大同", "晋城", "长治", "忻州", "阳泉", "朔州", "湖南", "长沙", "株洲", "衡阳", "郴州", "常德", "岳阳", "永州", "邵阳", "怀化", "益阳", "湘潭", "娄底", "张家界", "湘西", "江西", "南昌", "赣州", "九江", "上饶", "景德镇", "吉安", "鹰潭", "宜春", "抚州", "萍乡", "新余", "安徽", "合肥", "滁州", "宿州", "安庆", "六安", "蚌埠", "亳州", "阜阳", "芜湖", "宣城", "巢湖", "铜陵", "淮南", "马鞍山", "内蒙古", "呼和浩特", "呼伦贝尔", "赤峰", "包头", "巴彦淖尔", "鄂尔多斯", "乌海", "乌兰察布", "兴安盟", "锡林郭勒盟", "阿拉善盟", "甘肃", "兰州", "武威", "张掖", "嘉峪关", "天水", "平凉", "陇南", "庆阳", "定西", "酒泉", "白银", "金昌", "临夏", "海南", "海口", "三亚", "儋州", "万宁", "五指山", "琼海", "东方", "贵州", "贵阳", "遵义", "六盘水", "黔南", "毕节", "安顺", "铜仁", "黔东南", "黔西南", "宁夏", "银川", "吴忠", "石嘴山", "固原", "中卫", "青海", "西宁", "海西", "玉树", "海东", "西藏", "拉萨", "那曲", "林芝", "日喀则", "台湾", "香港", "香港", "澳门", "澳门"];
    for (let i = 0; i < citys.length; i++) {
        if (str.indexOf(citys[i]) >= 0) {
            return true;
        }
    }
    return false;
};

const emoji = {
    "[doge]": "🐶",
    "[喵喵]": "🐱",
    "[二哈]": "🐶",
    "[笑哭]": "😂",
    "[跪了]": "😂",
    "[打脸]": "😂",
    "[笑cry]": "😂",
    "[摊手]": "╮(╯▽╰)╭",
    "[污]": "🙈",
    "[抱抱]": "🤗",
    "[坏笑]": "😏",
    "[舔屏]": "😍",
    "[嘻嘻]": "😝️",
    "[哈哈]": "😄",
    "[可爱]": "😊",
    "[微笑]": "😊",
    "[吃惊]": "😲",
    "[害羞]": "☺️",
    "[挤眼]": "😉",
    "[闭嘴]": "🤐",
    "[鄙视]": "👎",
    "[爱你]": "😘",
    "[鲜花]": "😘",
    "[草泥马]": "🐶",
    "[小黄人高兴]": "😆",
    "[泪]": "😭",
    "[亲亲]": "😙",
    "[生病]": "😷",
    "[太开心]": "😆",
    "[白眼]": "🙄",
    "[右哼哼]": "😒",
    "[左哼哼]": "😒",
    "[衰]": "🤕",
    "[委屈]": "😢",
    "[哈欠]": "😪",
    "[抱抱_旧]": "🤗",
    "[怒]": "😡",
    "[疑问]": "❓",
    "[馋嘴]": "😋",
    "[拜拜]": "👋",
    "[思考]": "🤔",
    "[汗]": "😅",
    "[困]": "😴",
    "[睡]": "💤",
    "[钱]": "💰",
    "[失望]": "😞",
    "[酷]": "😎",
    "[色]": "😍",
    "[哼]": "😒",
    "[鼓掌]": "👏",
    "[晕]": "😲",
    "[悲伤]": "😭",
    "[黑线]": "😓",
    "[怒骂]": "╰（‵□′）╯",
    "[心]": "❤️",
    "[伤心]": "💔",
    "[猪头]": "🐷",
    "[熊猫]": "🐼",
    "[兔子]": "🐰",
    "[ok]": "👌",
    "[耶]": "✌️",
    "[good]": "👍",
    "[NO]": "🙅",
    "[赞]": "👍",
    "[来]": "(;´▽`)y-~~",
    "[弱]": "👎",
    "[囧]": "😂",
    "[浮云]": "☁️",
    "[话筒]": "🎙",
    "[蜡烛]": "🕯",
    "[蛋糕]": "🎂",
    "[并不简单]": "🤓",
    "[吃瓜]": "🍉",
    "[笑而不语]": "😉",
    "[允悲]": "😢",
    "[憧憬]": "😂",
    "[费解]": "？",
    "[抓狂]": "😖",
    "[偷笑]": "😂",
    "[男孩儿]": "👦",
    "[阴险]": "😏",
    "[嘘]": "😂",
    "[挖鼻]": "😂",
    "[偷乐]": "😂",
    "[震惊]": "😲",
    "[给力]": "💪",
    "[可怜]": "😢",
    "[乖巧]": "🙂",
    "[笑]": "😀",
    "[调皮]": "😜",
    "[眼镜]": "👓",
    "[大笑]": "😄",
    "[乐观]": "😀",
    "[馋]": "😋",
    "[飞吻]": "😘",
    "[天使]": "😇",
    "[黑镜]": "🕶",
    "[咧嘴]": "😁",
    "[开心]": "😊",
    "[棒]": "👍"
};

exports.checkChinese = checkChinese;
exports.yesterdayTimestamp = yesterdayTimestamp;
exports.city = city;
exports.emoji = emoji;